using System.Windows.Forms;


//*******************************************************************************
//프로그램명    ISpannedCell.cs
//메뉴ID        
//설명          ISpannedCell
//작성일        2012.12.06
//개발자        남인호
//*******************************************************************************
// 변경일자     변경자      요청자      요구사항ID          요청 및 작업내용
//*******************************************************************************
//
//
//*******************************************************************************

namespace KR_POP.Common.ControlEX
{
    interface ISpannedCell
    {
        int ColumnSpan { get; }
        int RowSpan { get; }
        DataGridViewCell OwnerCell { get; }
        bool Hide {get; set;}
    }
}