using System;


//*******************************************************************************
//프로그램명    IProcedure.cs
//메뉴ID        
//설명          모든 화면에서 공통으로 버튼 이벤트를 처리할 함수들의 Interface
//작성일        2012.12.06
//개발자        남인호
//*******************************************************************************
// 변경일자     변경자      요청자      요구사항ID          요청 및 작업내용
//*******************************************************************************
//
//
//*******************************************************************************



namespace KR_POP
{
    // 요약:
    //     어플리케이션에서 구현되는 프로시저를 정의한 인터페이스 입니다.
    public interface IProcedure
    {
        // 요약:
        //     화면 초기화작업
        void procClear();
        //
        // 요약:
        //     입력작업
        void procInsert();
        //
        // 요약:
        //     수정작업
        void procUpdate();
        //
        // 요약:
        //     삭제작업
        void procDelete();
        //
        // 요약:
        //     저장작업
        void procSave();
        //
        // 요약:
        //     조회작업
        void procQuery();
        //
        // 요약:
        //     출력작업
        void procPrint();
        //
        // 요약:
        //     파일변환작업
        void procExcel();
    }
}
